###############################################################
#  Generated by:      Cadence Innovus 20.10-p004_1
#  OS:                Linux x86_64(Host ID ece.bmsce.ac.in)
#  Generated on:      Fri Nov 21 14:30:02 2025
#  Design:            Faulty_EVM
#  Command:           routeDesign -globalDetail
###############################################################
current_design Faulty_EVM
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock  -name vclk -period 5.000000 -waveform {0.000000 2.500000}
create_clock [get_ports {clk}]  -name clk -period 5.000000 -waveform {0.000000 2.500000}
set_propagated_clock  [get_ports {clk}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {clk}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {clk}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {reset}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {reset}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {reset}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {reset}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {A_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {A_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {A_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {A_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {B_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {B_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {B_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {B_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {C_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {C_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {C_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {C_Push}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {ballot_signal}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {ballot_signal}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {ballot_signal}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {ballot_signal}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -min -pin Y [get_ports {show_result}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -min -pin Y [get_ports {show_result}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -rise -max -pin Y [get_ports {show_result}]
set_driving_cell -lib_cell BUFX12 -library slow_vdd1v0 -fall -max -pin Y [get_ports {show_result}]
set_load -pin_load -max  0.0022  [get_ports {A_Led}]
set_load -pin_load -min  0.0022  [get_ports {A_Led}]
set_load -pin_load -max  0.0022  [get_ports {B_Led}]
set_load -pin_load -min  0.0022  [get_ports {B_Led}]
set_load -pin_load -max  0.0022  [get_ports {C_Led}]
set_load -pin_load -min  0.0022  [get_ports {C_Led}]
set_load -pin_load -max  0.0022  [get_ports {buzzer_output}]
set_load -pin_load -min  0.0022  [get_ports {buzzer_output}]
set_load -pin_load -max  0.0022  [get_ports {limit_exceeded}]
set_load -pin_load -min  0.0022  [get_ports {limit_exceeded}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[7]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[7]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[6]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[6]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[5]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[5]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[4]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[4]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[3]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[3]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[2]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[2]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[1]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[1]}]
set_load -pin_load -max  0.0022  [get_ports {A_Count[0]}]
set_load -pin_load -min  0.0022  [get_ports {A_Count[0]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[7]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[7]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[6]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[6]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[5]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[5]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[4]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[4]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[3]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[3]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[2]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[2]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[1]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[1]}]
set_load -pin_load -max  0.0022  [get_ports {B_Count[0]}]
set_load -pin_load -min  0.0022  [get_ports {B_Count[0]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[7]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[7]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[6]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[6]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[5]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[5]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[4]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[4]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[3]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[3]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[2]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[2]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[1]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[1]}]
set_load -pin_load -max  0.0022  [get_ports {C_Count[0]}]
set_load -pin_load -min  0.0022  [get_ports {C_Count[0]}]
set_wire_load_mode enclosed
set_input_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Push}]
set_input_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {reset}]
set_input_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Push}]
set_input_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Push}]
set_input_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {show_result}]
set_input_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {ballot_signal}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Led}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[2]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[0]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[7]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[5]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[3]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Led}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[7]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[1]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[5]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[3]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[7]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[1]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[5]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {limit_exceeded}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[3]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {buzzer_output}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[1]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[6]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[4]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[2]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[6]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Count[0]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {C_Led}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[4]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[2]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[6]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {B_Count[0]}]
set_output_delay -add_delay 1.75 -clock [get_clocks {vclk}] [get_ports {A_Count[4]}]
set_clock_uncertainty  0.4 [get_ports {clk}]
